damercer/Extended-CyScope/CY8CKIT-059/ScopePSoC/Scope-CY8CKIT-59.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "CyTriggerClock.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ADC_2.h"
#include "ADC_1.h"
#include "USBUART.h"
#include "USBUART_audio.h"
#include "USBUART_cdc.h"
#include "USBUART_hid.h"
#include "USBUART_midi.h"
#include "USBUART_pvt.h"
#include "USBUART_cydmac.h"
#include "USBUART_msc.h"
#include "Scope_A_aliases.h"
#include "Scope_A.h"
#include "Scope_B_aliases.h"
#include "Scope_B.h"
#include "SampleClock.h"
#include "ADCClock.h"
#include "Trigger_Comp.h"
#include "Vtrigger.h"
#include "Amux_Trigger.h"
#include "Trigger_Control.h"
#include "DMA_Channel_1_dma.h"
#include "DMA_Channel_2_dma.h"
#include "PWM_Sample_Buffer.h"
#include "Trigger_Status.h"
#include "ScopeA_Buf.h"
#include "ScopeB_Buf.h"
#include "WaveB_DAC.h"
#include "WaveB_Buf.h"
#include "AuxDAC_1.h"
#include "Scope_D_aliases.h"
#include "Scope_D.h"
#include "AuxDAC_Out_aliases.h"
#include "AuxDAC_Out.h"
#include "AMux_1.h"
#include "AuxDAC_Buf.h"
#include "External_Trigger_aliases.h"
#include "External_Trigger.h"
#include "WaveA_DAC.h"
#include "WaveA_Buf.h"
#include "WaveA_Out_aliases.h"
#include "WaveA_Out.h"
#include "WaveA_Clock.h"
#include "PRS.h"
#include "Wave_Control.h"
#include "NoiseA_Clock.h"
#include "Digital_Out_Control.h"
#include "LED_aliases.h"
#include "LED.h"
#include "DigOut_0_aliases.h"
#include "DigOut_0.h"
#include "DigOut_1_aliases.h"
#include "DigOut_1.h"
#include "DigIn_0_aliases.h"
#include "DigIn_0.h"
#include "Digital_Input_Status.h"
#include "DigIn_1_aliases.h"
#include "DigIn_1.h"
#include "Button_aliases.h"
#include "Button.h"
#include "Digital_PWM.h"
#include "PWMOut_0_aliases.h"
#include "PWMOut_0.h"
#include "PWMOutB_0_aliases.h"
#include "PWMOutB_0.h"
#include "PWM_Clock.h"
#include "AMux_2.h"
#include "Trig_Out_aliases.h"
#include "Trig_Out.h"
#include "Scope_C_aliases.h"
#include "Scope_C.h"
#include "DigIn_4_aliases.h"
#include "DigIn_4.h"
#include "DigIn_3_aliases.h"
#include "DigIn_3.h"
#include "DigIn_2_aliases.h"
#include "DigIn_2.h"
#include "DigOut_4_aliases.h"
#include "DigOut_4.h"
#include "DigOut_3_aliases.h"
#include "DigOut_3.h"
#include "DigOut_2_aliases.h"
#include "DigOut_2.h"
#include "WaveB_Out_aliases.h"
#include "WaveB_Out.h"
#include "ScopeC_Buf.h"
#include "ScopeD_Buf.h"
#include "AWC2_aliases.h"
#include "AWC2.h"
#include "AWC1_aliases.h"
#include "AWC1.h"
#include "VRef_Buf.h"
#include "VRef_Out_aliases.h"
#include "VRef_Out.h"
#include "ADC_2_IRQ.h"
#include "ADC_2_Bypass_aliases.h"
#include "ADC_2_Bypass.h"
#include "ADC_1_IRQ.h"
#include "ADC_1_Bypass_aliases.h"
#include "ADC_1_Bypass.h"
#include "USBUART_Dm_aliases.h"
#include "USBUART_Dm.h"
#include "USBUART_Dp_aliases.h"
#include "USBUART_Dp.h"
#include "WaveB_DAC_Wave1_DMA_dma.h"
#include "WaveB_DAC_Wave2_DMA_dma.h"
#include "WaveB_DAC_VDAC8.h"
#include "WaveA_DAC_Wave1_DMA_dma.h"
#include "WaveA_DAC_Wave2_DMA_dma.h"
#include "WaveA_DAC_VDAC8.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

